[{"id":"1","guid":null,"page_code_title":"blog_title_1","page_code_subtitle":"blog_subtitle_1","page_code_text":"blog_text_1","image":"","image_instagram":null,"title":"h","alt":null,"text":"<p>h<\/p>","tags":"fasting","subtitle":"h","title_pt":"As 7 dicas que todos os iniciantes de musculação devem saber antes de começar a treinar","subtitle_pt":"As 7 dicas que todos os iniciantes de musculação devem saber antes de começar a treinar","text_pt":"<p><br><strong>Fazer um aquecimento de cinco a dez minutos antes de come&ccedil;ar a treinar&nbsp;<\/strong><\/p>\r\n<p><br>O aquecimento n&atilde;o deve ser negligenciado por nenhum praticante, mas especialmente pelos iniciantes. &Eacute; no aquecimento que o corpo se prepara para cargas mais elevadas, a circula&ccedil;&atilde;o sangu&iacute;nea, a respira&ccedil;&atilde;o e o ritmo card&iacute;aco aumentam, fazendo com que o corpo comece a aquecer e a preparar as articula&ccedil;&otilde;es, m&uacute;sculos e ligamentos para os exerc&iacute;cios com carga. &nbsp;Fazer atividades sem um bom aquecimento aumenta o risco de les&atilde;o. Fazer pelo menos cinco minutos de exerc&iacute;cios aer&oacute;bicos leves, como caminhar ou andar de bicicleta, alguns exerc&iacute;cios de mobilidade articular, alongamentos din&acirc;micos para o grupo muscular que vai ser treinado e\/ou movimentos com pesos leves, s&atilde;o alguns exemplos que um iniciante pode adotar no in&iacute;cio de um treino.<\/p>\r\n<p><br><strong>Come&ccedil;ar nas m&aacute;quinas de muscula&ccedil;&atilde;o antes de come&ccedil;ar nos pesos livres<\/strong><\/p>\r\n<p><br>As m&aacute;quinas de muscula&ccedil;&atilde;o possuem mais estabilidade e seguran&ccedil;a na execu&ccedil;&atilde;o dos movimentos do que com pesos livres. Os exerc&iacute;cios nas m&aacute;quinas possibilitam um conforto e seguran&ccedil;a maior, pois permitem a comodidade, posi&ccedil;&atilde;o e percurso perfeito do movimento. Os praticantes iniciantes, de forma geral, t&ecirc;m mais dificuldades em realizar os movimentos com pesos livres, pelo simples fato de movimentos com pesos livres requerem mais t&eacute;cnica e mais experi&ecirc;ncia. As m&aacute;quinas, por outro lado, ajudam a guiar o movimento e a diminuir erros posturais, atribuindo uma maior confian&ccedil;a aos executantes.&nbsp;<br>Os exerc&iacute;cios com os pesos livres devem ser introduzidos aos poucos, &agrave; medida que o praticante vai ganhando confian&ccedil;a e aumentando os seus n&iacute;veis de for&ccedil;a e consci&ecirc;ncia corporal. Os mesmos possibilitam movimentos com maior amplitude, trabalham mais os m&uacute;sculos estabilizadores e permitem trabalhar v&aacute;rios grupos musculares ao mesmo tempo, porem um iniciante pode ter dificuldades, visto que s&atilde;o movimentos de maior complexidade.<\/p>\r\n<p><br><strong>Come&ccedil;ar com cargas ajustadas aos n&iacute;veis de for&ccedil;a e respeitar a fase de adapta&ccedil;&atilde;o<\/strong><\/p>\r\n<p><br>Um iniciante de muscula&ccedil;&atilde;o n&atilde;o est&aacute; habituado a levantar, empurrar, nem puxar cargas. Faz muito tempo que n&atilde;o carrega nenhum peso e qualquer carga para eles ser&aacute; um &ldquo;choque&rdquo; para os m&uacute;sculos, articula&ccedil;&otilde;es e tend&otilde;es. Por este motivo &eacute; que existe a fase de adapta&ccedil;&atilde;o, onde o corpo vai sofrer v&aacute;rias adapta&ccedil;&otilde;es e reconhecer os novos est&iacute;mulos neurais. Se um iniciante n&atilde;o passasse pela fase de adapta&ccedil;&atilde;o e come&ccedil;asse com treinos avan&ccedil;ados, cheios de cargas, com alto impacto, intensidade e volume, provavelmente n&atilde;o iria conseguir finalizar o treino, iria ficar frustrado e corria o risco de se lesionar.<br>No geral e de forma a simplificar, as cargas devem ser ajustadas para a realiza&ccedil;&atilde;o de 2 a 3 s&eacute;ries de 12 a 15 repeti&ccedil;&otilde;es por exerc&iacute;cio. Alguns grupos musculares podem necessitar de mais repeti&ccedil;&otilde;es (12-20 reps), como por exemplo, os abdominais, os g&eacute;meos, os posteriores de coxa e os ombros, visto que s&atilde;o m&uacute;sculos que numa fase inicial s&atilde;o dif&iacute;ceis de trabalhar com cargas elevadas (sem falhar uma boa execu&ccedil;&atilde;o), e a estrat&eacute;gia de aumentar as repeti&ccedil;&otilde;es parece ser a mais indicada.<\/p>\r\n<p><br><strong>Aumentar a carga gradualmente, priorizando qualidade sobre quantidade.<\/strong><\/p>\r\n<p><br>&Eacute; aconselhado aumentar as cargas de treino (para as mesmas repeti&ccedil;&otilde;es) quando os m&uacute;sculos j&aacute; se acostumaram &agrave; carga atual e j&aacute; se familiarizaram com o exerc&iacute;cio. Essa comodidade &eacute; o principal sinal de que est&aacute; na hora de intensificar o treino.&nbsp;<br>Priorizar qualidade sobre quantidade &eacute; fundamental. O principal objetivo de um iniciante dever&aacute; passar pela aprendizagem correta e aperfei&ccedil;oamento dos movimentos, para que posteriormente quando forem aumentar as cargas, a execu&ccedil;&atilde;o correta seja mantida. Aumentar as cargas todos os treinos ou de forma abrupta (numa fase inicial, de 2 a 4 semanas), n&atilde;o parece ser a melhor estrat&eacute;gia. &Eacute; necess&aacute;rio que o treino evolua sempre de maneira progressiva para evitar qualquer tipo de les&otilde;es por excesso de carga. &nbsp;<\/p>\r\n<p><br><strong>Treinar todos os grupos musculares do corpo, sem negligenciar nenhum.<\/strong><\/p>\r\n<p><br>&Eacute; muito frequente observar praticantes de muscula&ccedil;&atilde;o que treinam constantemente o mesmo grupo muscular (normalmente o que gostam mais, ou o musculo que tem mais for&ccedil;a) e a darem menos foco a outros. Algumas pessoas sonham em ter bra&ccedil;os enormes, mas n&atilde;o ligam muito para as pernas, outras desejam ter pernas definidas, deixando os membros superiores para segundo plano. Apesar disso ser comum, o mais correto &eacute; treinar todos os grupos musculares do corpo na mesma medida.<br>Alternar os grupos musculares e nunca treinar a mesma regi&atilde;o dois dias seguidos.&nbsp;<br>Um iniciante dever&aacute; procurar ajuda de um profissional da &aacute;rea com vista &agrave; aquisi&ccedil;&atilde;o de um plano de treino estruturado e de acordo com os seus objetivos e patologias associadas. Um praticante inexperiente n&atilde;o deve treinar todos os grupos musculares num s&oacute; dia, para n&atilde;o sobrecarregar o corpo. Com o exposto, &eacute; recomendado treinar um grupo muscular por dia, para que no dia seguinte possa voltar a treinar outro grupo muscular, permitindo uma recupera&ccedil;&atilde;o completa do musculo que foi treinado no dia anterior. Os m&uacute;sculos depois de serem &ldquo;destru&iacute;dos&rdquo;, necessitam de descanso para serem regenerados e criarem fibras musculares. &Eacute; por isso que &eacute; importante agendar alguns dias sem exerc&iacute;cios.&nbsp;<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><strong>Comer e dormir bem faz parte do treino<\/strong><\/p>\r\n<p><br>Um bom treino sem uma boa alimenta&ccedil;&atilde;o e uma boa noite de sono, pode comprometer o ganho de massa muscular, for&ccedil;a e\/ou perda de massa gorda. Uma boa alimenta&ccedil;&atilde;o &eacute; essencial. Os alimentos s&atilde;o utilizados pelo nosso organismo para construir novos tecidos e repor a energia dentro dos m&uacute;sculos. Os iniciantes devem privilegiar refei&ccedil;&otilde;es ricas em prote&iacute;nas, cereais integrais, frutas e vegetais, para potenciar a recupera&ccedil;&atilde;o muscular e repor a energia. Evitar alimentos processados e cheios de a&ccedil;&uacute;car, pois podem inflamar ainda mais o corpo e aumentar as dores musculares. Embora ter uma alimenta&ccedil;&atilde;o saud&aacute;vel seja ideal, passar fome pode retardar o metabolismo e diminuir as chances de perder peso e ganhar m&uacute;sculos.<br>Al&eacute;m de um &oacute;timo treino e de uma alimenta&ccedil;&atilde;o balanceada, descansar &eacute; fundamental. Dormir entre 7-8 horas, al&eacute;m de recuperar os tecidos musculares &ldquo;danificados&rdquo; no treino, recomp&otilde;e fun&ccedil;&otilde;es org&acirc;nicas e neurol&oacute;gicas.&nbsp;<\/p>\r\n<p>&nbsp;<\/p>","title_es":"n\/a","subtitle_es":"n\/a","text_es":"n\/a","title_en":"7 tips every beginner bodybuilder should know before starting training","subtitle_en":"7 tips every beginner bodybuilder should know before starting training","text_en":"<p style=\"margin: 0cm; background: white;\"><strong><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\">Warm up for five to ten minutes before you start training<\/span><\/strong><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>Warming should not be neglected by any practitioner, but especially by beginners. It is in the heating that the body prepares for higher loads, blood circulation, breathing and heart rate increase, causing the body to start to warm up and prepare joints, muscles and ligaments for exercise with load. &nbsp;Doing activities without good heating increases the risk of injury. Doing at least five minutes of light aerobic exercises, such as walking or cycling, some joint mobility exercises, dynamic stretching for the muscle group that will be trained and\/or light weight movements, are some examples that a beginner can adopt at the beginning of a workout.<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br><strong>Start at the bodybuilding machines before you start at the free weights<\/strong><\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>Bodybuilding machines have more stability and safety in the execution of movements than with free weights. The exercises in the machines allow greater comfort and safety, as they allow the convenience, position and perfect route of movement. Novice practitioners, in general, have more difficulties in performing the movements with free weights, because movements with free weights require more technique and more experience. Machines, on the other hand, help guide movement and reduce postural errors, giving more confidence to performers.&nbsp;Exercises with free weights should be introduced gradually, as the practitioner regains confidence and increasing their levels of strength and body awareness. They enable movements with greater amplitude, work more the stabilizing muscles and allow working several muscle groups at the same time, but a beginner can have difficulties, since they are more complex movements.<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br><strong>Start with loads adjusted to strength levels and respect the adaptation phase<\/strong><\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>A bodybuilding beginner is not used to lifting, pushing, or pulling loads. It's been a long time since it carries any weight and any load for them will be a \"shock\" to muscles, joints and tendons. For this reason is that there is the adaptation phase, where the body will undergo various adaptations and recognize the new neural stimuli. If a beginner did not go through the adaptation phase and started with advanced training, full of loads, with high impact, intensity and volume, probably would not be able to finish the training, would get frustrated and risk ed if injured. In general and in order to simplify, the loads should be adjusted for the performance of 2 to 3 sets of 12 to 15 repetitions per exercise. Some muscle groups may require more repetitions (12-20 reps), such as the abdominals, twins, thigh posteriors and shoulders, since they are muscles that at an early stage are difficult to work with high loads (without failing a good execution), and the strategy of increasing repetitions seems to be the most indicated.<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br><strong>Increase the load gradually, prioritizing quality over quantity.<\/strong><\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>It is advisable to increase the training loads (for the same repetitions) when the muscles have become accustomed to the current load and have become familiar with the exercise. This convenience is the main sign that it is time to intensify the training.&nbsp;Prioritizing quality over quantity is critical. The main objective of a beginner should be to learn correctly and improve the movements, so that later when loads are increased, the correct execution is maintained. Increasing loads every workout or abruptly (at an early stage, 2 to 4 weeks), does not seem to be the best strategy. Training must always evolve progressively to avoid any type of injury due to overload.<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br><strong>Train all muscle groups of the body without neglecting any.<\/strong><\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>It is very common to observe bodybuilding practitioners who constantly train the same muscle group (usually what they like the most, or the muscle that has the most strength) and give less focus to others. Some people dream of having huge arms, but do not care much for the legs, others wish to have defined legs, leaving the upper limbs for the background. Although this is common, the most correct is to train all muscle groups of the body to the same extent. Switch muscle groups and never train the same region two days in a row.&nbsp;A beginner should seek help from a professional in the area with a view to acquiring a structured training plan and according to their associated objectives and pathologies. An inexperienced practitioner should not train all muscle groups in a single day, so as not to overload the body. With the above, it is recommended to train one muscle group per day, so that the next day you can return to training another muscle group, allowing a complete recovery of the muscle that was trained the day before. Muscles after being \"destroyed\" require rest to be regenerated and create muscle fibers. That's why it's important to schedule a few days without exercise.<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span style=\"font-size: 12.5pt; font-family: Poppins; color: #00172e;\">&nbsp;<\/span><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><strong><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\">Eating and sleeping well is part of the workout<\/span><\/strong><\/p>\r\n<p style=\"margin: 0cm; background: white;\"><span lang=\"EN\" style=\"font-size: 12.5pt; color: #00172e; mso-ansi-language: EN;\"><br>A good workout without a good diet and a good night's sleep can compromise muscle mass gain, strength and\/or fat mass loss. Good nutrition is essential. Food is used by our body to build new tissues and recharge energy within muscles. Beginners should focus on protein-rich meals, whole grains, fruits and vegetables to enhance muscle recovery and recharge energy. Avoid processed foods filled with sugar as they can further inflame the body and increase muscle pain. Although having a healthy diet is ideal, starvation can slow down metabolism and decrease the chances of losing weight and gaining muscles. In addition to a great workout and a balanced diet, rest is essential. Sleeping between 7-8 hours, in addition to recovering \"damaged\" muscle tissues in training, recomposes organic and neurological functions.<\/span><\/p>\r\n<p class=\"MsoNormal\">&nbsp;<\/p>","title_it":"n\/a","subtitle_it":"n\/a","text_it":"n\/a","title_fr":"n\/a","subtitle_fr":"n\/a","text_fr":"n\/a","title_de":"n\/a","subtitle_de":"n\/a","text_de":"n\/a","username":"","active":"1","created_date":"2023-01-24 13:50:58"}]